#include <stdio.h>

/*
 * 函数名称 : MovePos
 * 函数介绍 : 移动相应的行列
 * 参数介绍 : hang : 移动的行,正为向上,负为向下,   lie : 移动的列,正为向上,负为向下
 */
void MovePos(int hang, int lie)
{
	if ( hang > 0)
	{
		printf("\33[%dA", hang);
	}
	else
	{
		printf("\33[%dB", -hang);
	}
	
	if ( hang > 0)
	{
		printf("\33[%dC", lie);
	}
	else
	{
		printf("\33[%dD", -lie);
	}
}


/*
 * 函数名称 : savePos
 * 函数介绍 : 保存当前光标位置
 */
void savePos()
{
	printf("\33[s");
}


/*
 * 函数名称 : goSavePos
 * 函数介绍 : 恢复之前保存的位置
 */
void goSavePos()
{
	printf("\33[u");
}

int main()
{
    printf("\033[41;36m 背景:深红 , 字:深绿 \033[0m \n");
    printf("\33[4m  下划线 \033[0m \n");
    printf("\033[41;36m \33[4m  背景:深红 , 字:深绿, 下划线 \033[0m \n");
	printf("\33[0m 关闭所有属性  \033[0m \n");
	printf("\33[1m 设置高亮度  \033[0m \n");
	printf("\33[5m 闪烁  \033[0m \n");
	printf("\33[7m 反显  \033[0m \n");
	printf("\33[8m 消隐  \033[0m \n");
	printf("\33[37m 设置前景色  \033[0m \n");
	printf("\33[47m 设置背景色  \033[0m \n");
	printf("\33[?25l 隐藏光标  \033[0m \n");
	printf("\33[?25h 显示光标  \033[0m \n");
    
    printf("查看下一行是否有影响\n");

   	printf("1234567890123456789012345657890\n");
   	printf("1234567890123456789012345657890\n");
   	printf("1234567890123456789012345657890\n");
   	printf("1234567890123456789012345657890\n");
   	printf("1234567890123456789012345657890\n");
   	printf("1234567890123456789012345657890\n");
   	printf("1234567890123456789012345657890\n");
   	printf("1234567890123456789012345657890\n");
   	printf("1234567890123456789012345657890\n");
   	printf("1234567890123456789012345657890\n");
   	printf("1234567890123456789012345657890\n");
   	printf("1234567890123456789012345657890\n");
   	savePos();  //保存位置
    MovePos(3, 4);
    printf("here");

    goSavePos(); //回复保存时的位置
    return 0;
}



/*
字背景颜色范围:40----49 
40:黑 
41:深红 
42:绿 
43:黄色 
44:蓝色 
45:紫色 
46:深绿 
47:白色 

字颜色:30-----------39 
30:黑 
31:红 
32:绿 
33:黄 
34:蓝色 
35:紫色 
36:深绿 
37:白色 

===============================================ANSI控制码的说明 
\33[0m 关闭所有属性 
\33[1m 设置高亮度 
\33[4m 下划线 
\33[5m 闪烁 
\33[7m 反显 
\33[8m 消隐 
\33[30m -- \33[37m 设置前景色 
\33[40m -- \33[47m 设置背景色 
\33[nA 光标上移n行 
\33[nB 光标下移n行 
\33[nC 光标右移n行 
\33[nD 光标左移n行 
\33[y;xH设置光标位置 
\33[2J 清屏 
\33[K 清除从光标到行尾的内容 
\33[s 保存光标位置 
\33[u 恢复光标位置 
\33[?25l 隐藏光标 
\33[?25h 显示光标
*/